{"_id":{"$oid":"60ec8fcdb87886936b704b4e"},"title":"Lord of the Rings","description":"The Fellowship of the Ring embark on a journey to destroy the One Ring and end Sauron's reign over Middle-earth. -IMDb","director":{"name":"Peter Jackson","bio":"Sir Peter Robert Jackson ONZ KNZM is a New Zealand film director, producer, and screenwriter. He is best known as the director, writer, and producer of the Lord of the Rings trilogy (2001–03) and the Hobbit trilogy (2012–14), both of which are adapted from the novels of the same name by J. R. R. Tolkien. He is the third-highest-grossing film director of all time, his films having made over $6.5 billion worldwide. -Wikipedia","birth_year":"1961","death_year":""},"actors":["Elijah Wood","Ian McKellen","Orlando Bloom"],"genre":{"name":"Adventure","description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. -Wikipedia"},"image_url":"https://cdn.shopify.com/s/files/1/0057/3728/3618/products/90d54a43253eb4f5b7e4c9b5903fd1c5_b5f82236-66bc-4d4b-aa2e-4cded70c25fd_480x.progressive.jpg?v=1573655072","featured":true}
{"_id":{"$oid":"60ec912e57305332ff582a4a"},"title":"Bohemian Rapsody","description":"The story of the legendary British rock band Queen and lead singer Freddie Mercury, leading up to their famous performance at Live Aid (1985). -IMDb","director":{"name":"Bryan Singer","bio":"Bryan Jay Singer is an American film director, producer and screenwriter. He is the founder of Bad Hat Harry Productions and has produced or co-produced almost all of the films he has directed. -Wikipedia","birth_year":"1965","death_year":""},"actors":["Rmi Malek","Lucy Boynton","Gwilym Lee"],"genre":{"name":"Biography","description":"A biographical film is a film that dramatizes the life of a non-fictional or historically-based person or people. Such films show the life of a historical person and the central character's real name is used. -Wikipedia"},"image_url":"https://cdn.shopify.com/s/files/1/0057/3728/3618/products/9cd663739cf13d44e01a27301d3cd6ad_dd21097b-d8a4-4f70-97b4-7eb5a0d7e1d0_480x.progressive.jpg?v=1573590267","featured":false}
{"_id":{"$oid":"60ec914057305332ff582a4b"},"title":"Inception","description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O. -IMDb","director":{"name":"Christopher Nolan","bio":"Christopher Edward Nolan is a British-American film director, producer, and screenwriter. His directorial efforts have grossed more than US$5 billion worldwide, garnered 36 Oscar nominations and 11 wins. Nolan's films are typically rooted in epistemological and metaphysical themes, exploring human morality, the construction of time, and the malleable nature of memory and personal identity. His work is permeated by mathematically inspired images and concepts, unconventional narrative structures, practical special effects, experimental soundscapes, large-format film photography, and materialistic perspectives. -Wikipedia","birth_year":"1970","death_year":""},"actors":["Leonardo DiCaprio","Joseph Gordon-Levitt","Elliot Page"],"genre":{"name":"Adventure","description":"Adventure films are a genre of film whose plots feature elements of travel. They typically involve protagonists who must leave their home or place of comfort and go to far away lands to fulfill a goal. -Wikipedia"},"image_url":"https://cdn.shopify.com/s/files/1/0057/3728/3618/products/9c592dee1ac813fcaf8c93557a487557_675ff711-4f45-4a98-95a5-0f97302b2126_480x.progressive.jpg?v=1573618688","featured":true}
{"_id":{"$oid":"60ec914e57305332ff582a4c"},"title":"Adam''s Apples","description":"A neo-nazi sentenced to community service at a church clashes with the blindly devotional priest. -IMDb","director":{"name":"Anders Thomas Jensen","bio":"Anders Thomas Jensen is a Danish screenwriter and film director. His film Election Night won the 1998 Academy Award for Best Live Action Short Film. -Wikipedia","birth_year":"1972","death_year":""},"actors":["Ulrich Thomsen","Mads Mikkelsen","Nicolas Bro"],"genre":{"name":"Comedy","description":"A comedy film is a category of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. -Wikipedia"},"image_url":"https://m.media-amazon.com/images/M/MV5BMTU4NTc5NjM5M15BMl5BanBnXkFtZTgwODEyMTE0MDE@._V1_.jpg","featured":true}
{"_id":{"$oid":"60ec915657305332ff582a4d"},"title":"Joker","description":"In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He then embarks on a downward spiral of revolution and bloody crime. This path brings him face-to-face with his alter-ego: the Joker. -IMDb","director":{"name":"Todd Phillips","bio":"Todd Phillips is an American filmmaker and occasional actor. Phillips began his career in 1993 and directed films in the 2000s such as Road Trip, Old School, Starsky & Hutch, and School for Scoundrels. He came to prominence in the early 2010s for directing The Hangover film series. In 2019, he co-wrote and directed the psychological thriller film Joker, which premiered at the 76th Venice International Film Festival where it received the top prize, the Golden Lion. -Wikipedia","birth_year":"1970","death_year":""},"actors":["Joaquin Phoenix","Robert De Niro","Zazie Beetz"],"genre":{"name":"Crime","description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection. -Wikipedia"},"image_url":"https://images-na.ssl-images-amazon.com/images/I/71wbalyU7tL._AC_SY606_.jpg","featured":false}
{"_id":{"$oid":"60ec915e57305332ff582a4e"},"title":"Gravity","description":"Two astronauts work together to survive after an accident leaves them stranded in space. -IMDb","director":{"name":"Alfonso Cuarón","bio":"Alfonso Cuarón is a Mexican film director, producer, screenwriter, cinematographer and editor. Cuarón is the first Mexico-born filmmaker to win the Academy Award for Best Director. He has been nominated for Academy Awards in six different categories, a record he shares with Walt Disney and George Clooney. -Wikipedia","birth_year":"1961","death_year":""},"actors":["Sandra Bullok","George Clooney"],"genre":{"name":"Sci-Fi","description":"Science fiction (or sci-fi) is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies. -Wikipedia"},"image_url":"https://images-na.ssl-images-amazon.com/images/I/41rv8YgGzcL._AC_.jpg","featured":false}
{"_id":{"$oid":"60ec916857305332ff582a4f"},"title":"The Prestige","description":"After a tragic accident, two stage magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other. -IMDb","director":{"name":"Christopher Nolan","bio":"Christopher Edward Nolan CBE is a British-American film director, producer, and screenwriter. His directorial efforts have grossed more than US$5 billion worldwide, garnered 36 Oscar nominations and 11 wins. Nolan's films are typically rooted in epistemological and metaphysical themes, exploring human morality, the construction of time, and the malleable nature of memory and personal identity. His work is permeated by mathematically inspired images and concepts, unconventional narrative structures, practical special effects, experimental soundscapes, large-format film photography, and materialistic perspectives. -Wikipedia","birth_year":"1970","death_year":""},"actors":["Christian Bale","Hugh Jackmann","Scarlett Johansson"],"genre":{"name":"Mystery","description":"A mystery film is a genre of film that revolves around the solution of a problem or a crime. It focuses on the efforts of the detective, private investigator or amateur sleuth to solve the mysterious circumstances of an issue by means of clues, investigation, and clever deduction. -Wikipedia"},"image_url":"https://blindthief10.github.io/vanilla_pills/posters/prestige.jpg","featured":false}
{"_id":{"$oid":"60ec917357305332ff582a50"},"title":"Mickey Blue Eyes","description":"An English auctioneer proposes to the daughter of a Mafia kingpin, only to realize that certain \"favors\" would be asked of him. -IMDb","director":{"name":"Kelly Makin","bio":"Kelly Makin is a Canadian television and film director. He directed episodes of The Kids in the Hall comedy television series and also directed several episodes of Queer as Folk including the series finale. More recently, Makin has directed episodes of Flashpoint, Less Than Kind, Death Comes to Town, and Vikings. He also directed two episodes of Being Erica and Nurses. In 2020 and 2021, he had directed four episodes of Burden of Truth. -Wikipedia","birth_year":"","death_year":""},"actors":["Hugh Grant","Jeanne Tripplehorn","James Caan"],"genre":{"name":"Comedy","description":"A comedy film is a category of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect. -Wikipedia"},"image_url":"https://images-na.ssl-images-amazon.com/images/I/516ldwRoqAL._AC_.jpg","featured":false}
{"_id":{"$oid":"60ec917c57305332ff582a51"},"title":"Toni Erdmann","description":"A practical joking father tries to reconnect with his hard working daughter by creating an outrageous alter ego and posing as her CEO's life coach. -IMDb","director":{"name":"Maren Ade","bio":"Maren Ade is a German film director, screenwriter and producer. Ade lives in Berlin, teaching screenwriting at the Film Academy Baden-Württemberg in Ludwigsburg. Together with Janine Jackowski and Jonas Dornbach, she runs the production company Komplizen Film. -Wikipedia","birth_year":"1976","death_year":""},"actors":["Sandra Hüller","Peter Simonischek","Michael Wittborn"],"genre":{"name":"Drama","description":"In film and television, drama is a category of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone. -Wikipedia"},"image_url":"https://www.filmposter-archiv.de/filmplakat/2016/toni-erdmann.jpg","featured":false}
{"_id":{"$oid":"60ec918557305332ff582a52"},"title":"Hidden Figures","description":"The story of a team of female African-American mathematicians who served a vital role in NASA during the early years of the U.S. space program -IMDb","director":{"name":"Theodore Melfi","bio":"Theodore Melfi is an American screenwriter, film director, and producer. His second film, St. Vincent starring Bill Murray, was released in 2014. In 2016, Melfi co-wrote, directed and produced Hidden Figures with Allison Schroeder, for which he received Oscar nominations for Best Picture and Best Adapted Screenplay. -Wikipedia","birth_year":"1970","death_year":""},"actors":["Taraji P. Henson","Octavia Spencer","Janelle Monáe"],"genre":{"name":"Biography","description":"A biographical film is a film that dramatizes the life of a non-fictional or historically-based person or people. Such films show the life of a historical person and the central character's real name is used. -Wikipedia"},"image_url":"https://images-na.ssl-images-amazon.com/images/I/710stdsMzzL._AC_SY879_.jpg","featured":false}
